# City Analysis

In [1]:
import sqlite3 as lite
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
from numpy import median
import numpy as np

In [2]:
conn = lite.connect('flatmates_data.db')

In [3]:
query = """SELECT *
FROM flatmates_rent_listings 
"""
df = pd.read_sql_query(query,conn)
len(df)

12629

In [26]:
cities = ["sydney", "melbourne", "brisbane", "perth", "adelaide", "canberra","hobart"]

In [35]:
def get_median_rent_in_city(city):
    query = """
    SELECT *
    FROM flatmates_rent_listings 
    WHERE city like '%""" + city + """%'
    """
    df = pd.read_sql_query(query,conn)
    return df['price'].median()

for city in cities:
    print(city, get_median_rent_in_city(city))

sydney 290.0
melbourne 220.0
brisbane 220.0
perth 210.0
adelaide 200.0
canberra 260.0
hobart 200.0

In [37]:
city = 'Sydney'

In [38]:
query = """
SELECT suburb, SUM(rooms_available) as rooms_available , SUM(price)/SUM(rooms_available) as average_price, date
FROM flatmates_rent_listings 
WHERE city like '%""" + city + """%'
GROUP BY suburb 
HAVING SUM(rooms_available)  > 5
AND average_price < 270
ORDER BY average_price DESC 
LIMIT 50
"""
df = pd.read_sql_query(query,conn)
df

                 suburb  rooms_available  average_price        date
0        Macquarie Park               16            269  1650107572
1               Redfern               50            268  1650107481
2            Willoughby                6            267  1650108895
3             St Peters                6            267  1650107981
4              Artarmon               10            267  1650107595
5              Cronulla               24            266  1650107504
6            Sans Souci                7            265  1650107754
7                Pymble                6            265  1650108611
8          North Sydney               14            264  1650107437
9          Darlinghurst               65            263  1650107515
10            Lane Cove               12            262  1650107527
11               Ultimo               45            261  1650107426
12             Homebush               14            260  1650107834
13             Vaucluse                8            258  1650107754
14            Haymarket               23            258  1650107515
15          Forestville                6            258  1650108240
16           Sutherland                8            257  1650108386
17            Drummoyne               15            257  1650107891
18               Botany               15            257  1650107800
19         South Coogee               16            256  1650107652
20          Neutral Bay               28            256  1650107437
21           Paddington               54            251  1650107550
22    North Strathfield                8            251  1650107617
23       Baulkham Hills               13            251  1650107561
24             Rockdale               28            250  1650107437
25              Newtown               56            250  1650107448
26           Kensington               38            247  1650107731
27             Ashfield               24            246  1650107538
28          Summer Hill               10            245  1650107743
29           Darlington                9            244  1650107606
30    Brighton-Le-Sands                6            243  1650108601
31            Wahroonga                6            240  1650107629
32           Schofields               11            238  1650107459
33               Bexley               10            237  1650107868
34          Seven Hills                6            235  1650107675
35         Forest Lodge                8            235  1650107448
36            Ermington                6            235  1650107708
37  Sydney Olympic Park               17            234  1650107504
38          Strathfield               23            234  1650107561
39            Petersham               22            232  1650107437
40           Manly Vale                6            232  1650109009
41            Hillsdale               11            231  1650107640
42             Westmead               13            229  1650107426
43              Kogarah               22            229  1650107426
44            Caringbah               12            229  1650107834
45            Kingsford               64            228  1650107481
46       Wentworthville                8            227  1650107640
47             Rosehill                6            225  1650108759
48              Hornsby               15            225  1650107697
49            Granville                6            225  1650108296

In [15]:
query = """SELECT suburb, SUM(rooms_available) as rooms_available , SUM(price)/SUM(rooms_available) as average_price
FROM flatmates_rent_listings 
WHERE city like '%""" + city + """%'
GROUP BY suburb 
HAVING SUM(rooms_available)  > 20
ORDER BY average_price DESC 
LIMIT 10"""
df = pd.read_sql_query(query,conn)
df

         suburb  rooms_available  average_price
0   North Bondi               32            403
1        Sydney               42            397
2   Bondi Beach               61            375
3         Manly               72            371
4       Zetland               34            359
5      Waterloo               40            350
6  Erskineville               23            325
7       Dee Why               33            323
8        Coogee               75            318
9         Bondi               52            317

In [17]:
query = """SELECT suburb, SUM(rooms_available) as rooms_available , SUM(price)/SUM(rooms_available) as average_price
FROM flatmates_rent_listings 
WHERE city like '%""" + city + """%'
AND NOT house_type = "Student Accommodation"
GROUP BY suburb 
HAVING SUM(rooms_available)  > 20
ORDER BY rooms_available DESC 
LIMIT 10"""
df = pd.read_sql_query(query,conn)
df

           suburb  rooms_available  average_price
0        Randwick               74            313
1          Coogee               73            324
2           Manly               72            371
3        Maroubra               65            278
4    Darlinghurst               64            262
5       Kingsford               62            225
6  Bondi Junction               62            310
7     Bondi Beach               60            374
8      Parramatta               58            240
9      Paddington               54            251

In [18]:
query = """SELECT suburb, SUM(rooms_available) as rooms_available , SUM(price)/SUM(rooms_available) as average_price
FROM flatmates_rent_listings 
WHERE city like '%""" + city + """%'
GROUP BY suburb 
HAVING SUM(rooms_available)  > 5
ORDER BY average_price  
LIMIT 10
"""
df = pd.read_sql_query(query,conn)
df

            suburb  rooms_available  average_price
0         Milperra                9             48
1        Lilyfield                7             73
2         Richmond                6            115
3          Belrose                7            116
4  Centennial Park               12            116
5          Padstow               14            116
6         Monterey                6            119
7       Riverstone               12            122
8      Cherrybrook                7            124
9        Oran Park               12            127